# PushButtonData Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PushButtonData Constructor
PushButtonData Class See Also
---
Constructs a new instance of PushButtonData.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PushButtonData(
	string name,
	string text,
	string assemblyName,
	string className
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String, _
	text As String, _
	assemblyName As String, _
	className As String _
)
```

Visual C++
---
```text
public:
PushButtonData(
	String^ name,
	String^ text,
	String^ assemblyName,
	String^ className
)
```

# ### Parameters
name
    Type: System..::..StringThe internal name of the new button.
text
    Type: System..::..StringThe user visible text seen on the new button.
assemblyName
    Type: System..::..StringThe assembly path of the button.
className
    Type: System..::..StringThe name of the class containing the implementation for the command.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is passed for one or more arguments. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also
PushButtonData Class
Autodesk.Revit.UI Namespace